<template>
  <div class="helper">
    <AppTitleBar title="帮助中心">
      <RouterLink class="returnHome" to="/">返回首页</RouterLink>
    </AppTitleBar>
    <section class="pageWidthWithCenter helper-main">
      <div class="helper-main-left">
        <div class="helperWrapper" v-for="(menu, index) in helpers" :key="menu.menuTitle">
          <p class="helperList-title">{{ menu.menuTitle }}</p>
          <ul class="helperList">
            <li class="helperList-item" :class="[subMenu === currentSubMenuContent && 'active']" v-for="(subMenu, subIndex) in menu.menuChildren" :key="subMenu.subMenuTitle" @click="switchContent(index, subIndex)">{{ subMenu.subMenuTitle }}</li>
          </ul>
        </div>
      </div>
      <div class="helper-main-right">
        <h2 class="helperContent-title">{{ currentSubMenuContent.subMenuTitle }}</h2>
        <article class="helperContent-item"  v-for="item in currentSubMenuContent.subMenuContent" :key="item.subMenuTitle">
          <p class="helperContent-item-title">{{ item.title }}</p>
          <div class="helperContent-item-content">
            <p v-for="content in item.content" :key="content">{{ content }}</p>
          </div>
        </article>
      </div>
    </section>
  </div>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue';
import AppTitleBar from '/@components/AppTitleBar/index.vue'

export default defineComponent({
  name: 'Helper',
  components: {AppTitleBar},
  setup() {
    const helpers = ref([
        {
          menuTitle: '常见问题',
          menuChildren: [
            {
              subMenuTitle: '专利申请',
              subMenuContent: [
                {
                  title: '1、专利的分类有哪些？',
                  content: ['专利包括发明专利、实用新型专利和外观设计专利。'],
                },
                {
                  title: '2、发明专利与实用新型有什么用？',
                  content: ['1、专利作为一种无形资产，具有巨大的商业价值，是提升企业竞争力的重要手段；', '2、企业将科研成果申请专利，是企业实施专利战略的基础，拥有一定数量的专利还作为企业上市和其他评审中的一项重要指标；', '3、通过法定程序确定发明创造的权利归属关系，从而有效保护发明创造成果，独占市场，以此换取最大的利益，确保自身生产与销售的安全性；', ' 4、专利技术可以作为商品出售（转让），实现其经济价值；', '5、企业拥有专利是申报高新技术企业、申请政府补贴等各类科技计划、项目的必要前提条件；', '6、形成企业知识产权资产，提升企业注册资本、企业价值 。' ],
                },
                {
                  title: '3、专利授权需要多长时间？',
                  content: ['外观专利授权时间：约3~6个月； 实用新型专利授权时间：约7~14个月； 发明专利授权时间：平均约22个月。'],
                },
                {
                  title: '4、专利授权的有效期是多久？',
                  content: ['发明专利保护期为20年；', '实用新型专利保护期为10年；', '外观专利保护期为10年。'],
                },
              ]
            },
            {
              subMenuTitle: '发明专利',
              subMenuContent: [
                {
                  title: '1、什么是发明专利？',
                  content: ['专利法所称发明是指对产品、方法或者其改进所提出的新的技术方案。其特点是：首先，发明是一项新的技术方案。是利用自然规律解决生产、科研、实验中各种问题的技术解决方案，一般由若干技术特征组成。其次，发明分为产品发明和方法发明两大类型。产品发明包括所有由人创造出来的物品，方法发明包括所有利用自然规律通过发明创造产生的方法。方法发明又可以分成制造方法和操作使用方法两种类型。另外，专利法保护的发明也可以是对现有产品或方法的改进。'],
                },
                {
                  title: '2、发明专利实质审查需要多长时间？',
                  content: ['专利实质审查的时间不确定，一般是6－18个月，取决于发明的内容，审查员对发明的理解和审查员的工作安排以及审查员与申请人或其代理人之间文件往复的时间。', '发明专利申请人在提出实质审查请求时以及在收到专利局发出的发明专利申请进入实质审查阶段通知书之日起三个月内，可以对发明专利申请主动提出修改。', '依据专利法，发明专利申请的审批程序包括受理、初审、公布、实审以及授权五个阶段。实用新型或者外观设计专利申请在审批中不进行早期公布和实质审查，只有受理、初审和授权三个阶段。'],
                },
                {
                  title: '3、什么是发明专利的实质审查？',
                  content: ['实质审查是发明专利申请在授权以前必经一个阶段。对发明专利申请进行实质审查的目的在于确定发明专利申请是否应当被授予专利权，特别是确定其是否符合专利法有关新颖性、创造性和实用性的规定。实质审查程序通常由申请人提出请求后启动。发明专利申请经实质审查没有发现驳回理由的，专利局会作出授予发明专利权的决定。'],
                },
                {
                  title: '4、发明专利和实用新型专利可以同时申请吗？',
                  content: ['同一个主题的发明专利和实用新型专利。如果同一天提交申请，并且申请在提交申明说本申请同时提交另一种申请，可以同时申请。', '《专利法》 规定  同样的发明创造只能授予一项专利权。但是，同一申请人同日对同样的发明创造既申请实用新型专利又申请发明专利，先获得的实用新型专利权尚未终止，且申请人声明放弃该实用新型专利权的，可以授予发明专利权。'],
                },
              ]
            },
            {
              subMenuTitle: '实用新型专利',
              subMenuContent: [
                {
                  title: '1、什么是实用新型专利？',
                  content: ['实用新型是指对产品的形状、构造或者其结合所提出的适于实用的新的技术方案。实用新型的创造性低于发明，实用新型只限于具有一定形状的产品，不能是一种方法，也不能是没有固定形状的产品。'],
                },
                {
                  title: '2、发明专利和实用新型专利的区别？',
                  content: ['实用新型与发明的不同之处在于，第一，实用新型只限于具有一定形状的产品，不能是一种方法，例如生产方法、试验方法、处理方法和应用方法等，也不能是没有固定形状的产品，如药品、化学物质、水泥等；第二，对实用新型专利的创造性要求不高，但实用性要强。'],
                },
                {
                  title: '3、实用新型专利需要多久授权及保护时间？',
                  content: ['实用新型从申请之日开始计算，一般是3~6个月左右授权，并向申请人发出授权登记通知书。当申请人依照授权登记通知书上的交费金额交纳相关的费用后，两个月左右就能拿到证书，同时，专利局就会把你的专利在国家知识产权局的网上进行公布。', '实用新型专利的有效期为10年，自申请日算起。'],
                },
                {
                  title: '4、授予实用新型专利的条件？',
                  content: ['1、新颖性：是指在申请日以前没有同样的发明或者实用新型在国内外出版物上公开发表过、在国内公开使用过或者以其他方式为公众所知，也没有同样的发明或者实用新型由他人向专利行政部门提出过申请并且记载在申请日以后公布的专利申请文件中。', '2、创造性：是指同申请日以前已有的技术相比，该实用新型有实质性特点和进步。', '3、实用性：是指该实用新型能够制造或者使用，并且能够产生积极效果。'],
                },
              ]
            },
            {
              subMenuTitle: '外观设计专利',
              subMenuContent: [
                {
                  title: '1、什么是外观设计专利？',
                  content: ['外观设计是指对产品的形状、图案或其结合以及色彩与形状、图案的结合所作出的富有美感并适于工业应用的新设计。'],
                },
                {
                  title: '2、申请外观设计专利多久才能授权？',
                  content: ['1、形式审查（受理)（5个工作日左右）', '2、初步审查（4-6个月左右）(注：若有补正，6-8个月）', '（注：期间收到驳回决定，可以在收到之日起3个月内向专利复审委员会请求复审)', '3、发证（2-3个月左右）', '4、总期限：6-8个月'],
                },
                {
                  title: '3、外观设计专利的保护期限是多久？',
                  content: ['外观设计专利权的期限为十年，自申请日起计算。'],
                },
              ]
            },
            {
              subMenuTitle: '专利无效',
              subMenuContent: [
                {
                  title: '1、专利失效后我可以三个月后再去缴费吗？',
                  content: ['不能的，收到专利权终止通知书后必须在两个月的时间进行恢复。'],
                },
                {
                  title: '2、专利无效的启动程序主体是什么？',
                  content: ['包括任何单位和个人，专利权人不得宣告自己的专利权全部无效。'],
                },
                {
                  title: '3、专利被无效后我什么时候能收到通知？',
                  content: ['进入专利权无效宣告程序后，专利复审委员会将专利权无效宣告请求书和有关文件的副本送交专利权人。'],
                },
                {
                  title: '4、专利权失效了还可以恢复吗？',
                  content: ['如因不可抗拒因素和当事人因其他正当理由延误缴费的可以自收到国务院专利行政部门的通知之日2个月内。'],
                },
              ]
            },

          ]
        },
        {
          menuTitle: '交易保障',
          menuChildren: [
            {
              subMenuTitle: '支付方式',
              subMenuContent: [
                {
                  title: '1、支持哪些支付方式？',
                  content: ['支持多种支付方式：支付宝、微信、银联、聚合扫码支付。'],
                },
              ]
            },
            {
              subMenuTitle: '签署法律合同',
              subMenuContent: [
                {
                  title: '专利《转让协议书》、《代理委托书》、《专利证书》解析',
                  content: ['（1）《转让协议书》和《代理委托书》是专利转让中上报国知识产权局的必须文件，为国家知识产权局样式文档，用于专利转让申报使用。《转让协议书》和《代理委托书》需要双方签字，我网报送国家知识产权局；', '（2）交易成功，收到客户剩余尾款后，我网将邮寄纸质版《手续合格通知书》、《专利证书》、《登记簿副本》、官费收据等文件给到客户。'],
                },

              ]
            },
            {
              subMenuTitle: '服务协议',
              subMenuContent: [
                {
                  title: '第九区服务协议',
                  content: ['本协议是您与第九区（https://www.9ip.com/）之间就第九区网站服务等相关事宜所订立的契约，请您仔细阅读本协议，当您访问和/或使用本网站，即表示接受并同意本协议的所有条件和条款。杭州第九区知识产权运营有限公司（以下简称“杭州第九区”）作为第九区（https://www.9ip.com/）的运营者，所提供的各项服务的所有权和运作权均归第九区所有。', '杭州第九区有权对本协议条款进行修改，修改后的协议一旦公布即有效代替原来的协议。用户可随时查阅最新协议。您如果不同意协议条款的修改，可以主动取消已经获得的服务；如果您继续使用服务，即视为您已经接受协议条款的修改。', '一、服务内容：', '1、第九区网站服务，是指第九区及其子公司、分公司或关联公司经营的一款网络服务产品（包括但不限于第九区的网页、电脑端及移动端等产品及其更新产品），第九区通过互联网络依法为用户提供互联网信息等服务。', '2、用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。', '3、用户提供的注册资料，用户同意：（1）提供合法、真实、准确、详尽的个人资料；（2）如有变动，及时更新用户资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且第九区保留终止用户使用第九区各项服务的权利。', '二、服务的提供、修改及终止', '1、用户在接受第九区各项服务的同时，同意接受第九区提供的各类信息服务。用户在此授权第九区可以向其电子邮件、手机、通信地址等发送商业信息。用户有权选择不接受第九区提供的各类信息服务，并进入第九区相关页面进行更改。', '2、第九区以现有的技术和条件向用户/会员提供服务，并尽最大努力保证您所浏览的商品/服务信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本网站显示的信息可能会有一定的滞后性或差错，对此情况请您知悉并理解。最终交易服务以双方建立的合同关系为准。', '3、第九区保留随时修改或中断服务而不需通知用户的权利。第九区有权行使修改或中断服务的权利，不需对用户或任何无直接关系的第三方负责。', '4、用户对本协议的修改有异议，或对第九区的服务不满，可以行使如下权利：', '（1）停止使用第九区的网络服务；', '（2）通过顾问等渠道告知第九区停止对其服务。结束服务后，用户使用第九区络服务的权利立即终止。在此情况下，第九区没有义务传送任何未处理的信息或未完成的服务给用户或任何无直接关系的第三方。', '三、用户信息的保密', '1、本协议所称之第九区用户信息是指符合法律、法规及相关规定，并符合下述范围的信息：', '（1）用户注册第九区时，向第九区提供的个人信息；', '（2）用户在使用第九区服务或访问网站网页时，第九区自动接收并记录的用户浏览器端或手机客户端数据，包括但不限于IP地址、网站Cookie中的资料及用户要求取用的网页记录；', '（3）其它第九区通过合法途径获取的用户个人信息。', '2、第九区承诺：', '非经法定原因或用户事先许可，第九区不会向任何第三方透露用户的密码、姓名、手机号码等非公开信息。', '3、在下述法定情况下，用户的个人信息将会被部分或全部披露：', '（1）经用户同意向用户本人或其他第三方披露；', '（2）根据法律、法规等相关规定，或行政机构要求，向行政、司法机构或其他法律规定的第三方披露；', '（3）其它第九区根据法律、法规等相关规定进行的披露。', '四、用户信息', '1、用户的用户名、密码和安全性', '（1）用户选择成为第九区注册用户的，可自行创建、修改昵称。用户名和昵称的命名及使用应遵守相关法律法规并符合网络道德。用户名和昵称中不能含有任何侮辱、威胁、淫秽、谩骂等侵害他人合法权益的文字。', '（2）用户有义务妥善保管第九区账号、用户名和密码，用户将对用户名和密码安全负全部责任。因用户原因导致用户名或密码泄露而造成的任何法律后果由用户本人负责。', '（3）用户有权修改其个人账户中各项可修改信息，自行选择昵称和录入介绍性文字，自行决定是否提供非必填项的内容；', '2、用户有权根据第九区网站规定，享受第九区提供的其它各类服务。', '3、用户义务', '（1）不得利用本站危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本站制作、复制和传播下列信息：', '1)煽动抗拒、破坏宪法和法律、行政法规实施的；', '2)煽动颠覆国家政权，推翻社会主义制度的；', '3)煽动分裂国家、破坏国家统一的；', '4)捏造或者歪曲事实，散布谣言，扰乱社会秩序的；', '5)宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；', '6)公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；', '7)损害国家机关信誉的；', '8)其他违反宪法和法律行政法规的；', '9)进行商业广告行为的。', '（2）用户不得通过任何手段恶意注册第九区站帐号，包括但不限于以牟利、炒作、套现、获奖等为目的多个账号注册。用户亦不得盗用其他用户帐号。', '如用户违反上述规定，则第九区有权直接采取一切必要的措施，包括但不限于删除用户发布的内容、暂停或查封用户帐号等措施。', '（3）禁止用户将第九区以任何形式作为从事各种非法活动的场所、平台或媒介。未经第九区的授权或许可，用户不得借用本站的名义从事任何商业活动，也不得以任何形式将第九区作为从事商业活动的场所、平台或媒介。', '（4）用户在第九区以各种形式发布的一切信息，均应符合国家法律法规等相关规定及网站相关规定，符合社会公序良俗，并不侵犯任何第三方主体的合法权益，否则用户自行承担因此产生的一切法律后果，且高航因此受到的损失，有权向用户追偿。', '五、知识产权及其它权利', '1、任何用户接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息的著作财产权，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权等，以及应当由著作权人享有的其他可转让权利无偿独家转让给第九区运营商所有，同时表明该用户许可第九区有权利就任何主体侵权而单独提起诉讼，并获得全部赔偿。本协议已经构成《著作权法》第二十五条所规定的书面协议，其效力及于用户在第九区发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。', '2、杭州第九区是第九区的制作者,拥有此网站内容及资源的版权,受国家知识产权保护,享有对本网站各种协议、声明的修改权；未经高航的明确书面许可，任何第三方不得为任何非私人或商业目的获取或使用本网站的任何部分或通过本网站可直接或间接获得的任何内容、服务或资料。任何第三方违反本协议的规定以任何方式，和/或以任何文字对本网站的任何部分进行发表、复制、转载、更改、引用、链接、下载或以其他方式进行使用，或向任何其他第三方提供获取本网站任何内容的渠道，则对本网站的使用权将立即终止，且任何第三方必须按照本公司的要求，归还或销毁使用本网站任何部分的内容所创建的资料的任何副本。', '3、第九区有权删除第九区站内各类不符合法律或协议规定的内容，而保留不通知用户的权利。', '六、适用法律和裁判地点', '1、因用户使用第九区网站而引起或与之相关的一切争议、权利主张或其它事项，均受中华人民共和国法律的管辖。', '2、用户和第九区发生争议的，应首先本着诚信原则通过协商加以解决。如果协商不成，则应向杭州第九区所在地人民法院提起诉讼。', '七、责任限制及不承诺担保', '除非有明确的书面说明，本网站及其所包含的或以其他方式方式通过本网站提供给您的全部信息、内容和服务均是在“现状”、“现有”的基础上提供的，除非另有明确的书面说明，杭州第九区不对本网站的运营及包含在本网站上的信息、内容和服务做任何形式、明示或默示的声明或担保。如因不可抗力或其他本网站无法控制的原因使本站系统崩溃或无法正常使用导致丢失有关信息、记录等，第九区会合理地尽力协助处理善后事宜。', '八、特别提醒', '第九区在此依法做出特别声明如下：本协议内容中以黑体、加粗、下划线等方式显著标识的条款，请用户着重阅读。', '您注册或登录本网站即视为您完全接受本协议。第九区网对本服务协议包括基于本服务协议制定的各项规则拥有最终解释权。'],
                },
              ]
            },

          ]
        },
        // {
        //   menuTitle: '联系我们',
        //   menuChildren: [
        //     {
        //       subMenuTitle: '联系方式',
        //       subMenuContent: [
        //         {
        //           title: '伟萍：',
        //           content: ['QQ:1724775458', '电话:15958822553'],
        //         },
        //         {
        //           title: '张工： ',
        //           content: ['QQ:3379575517', '电话:13282265523'],
        //         },
        //       ]
        //     },
        //     {
        //       subMenuTitle: '微信公众号',
        //       subMenuContent: [
        //         {
        //           title: '',
        //           content: [''],
        //         },
        //       ]
        //     },
        //   ]
        // },
      ])
    const currentSubMenuContent = ref(helpers.value[0].menuChildren[0])
    const switchContent = (index, subIndex) => currentSubMenuContent.value = helpers.value[index].menuChildren[subIndex]
    return {
      helpers,
      currentSubMenuContent,
      switchContent,
    }
  },
})
</script>

<style lang="scss" scoped>
.returnHome {
  color: #999999;
  font-size: 16px;
}
.helper-main {
  display: flex;
  font-size: 12px;
  &-left {
    margin-right: 10px;
    background-color: #fff;
    width: 150px;
  }
  &-right {
    background-color: #fff;
    flex: 1;
  }
}
.helperList {
  &-title {
    color: #FFF;
    background-color: #14A8BD;
    font-size: 14px;
    padding: 10px 20px;
    margin: 0;
  }
  &-item {
    padding: 12px 20px;
    transition: all .3s;
    cursor: pointer;
    &.active, &:hover {
      background-color: #F3FAFF;
      color: #14A8BD;
    }
  }
}
.helperContent {
  &-title {
    color: #14A8BD;
    padding: 20px 50px;
    border-bottom: 1px solid #E8E8E8;
  }
  &-item {
    padding: 10px 20px;
    &-title {
      font-weight: bold;
      padding: 15px 30px;
      background-color: #E8E8E8;
      margin: 0;
    }
    &-content {
      padding: 20px 30px;
      background-color: #F6F6F6;
    }
  }
}
</style>
